src/Catalogs/СтатьиЗатрат/СтатьиЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиЗатрат</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НПНК_</name>
      <description>Статьи затрат по структуре Декларации по прибыли</description>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ВидЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусМатериальныхЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.СтатусыМатериальныхЗатратНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ХарактерЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостояннаяЗатрата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет8Класса</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДекларацииПоНалогуНаПрибыль</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыЗатрат/ВидыЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗатрат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Материальные</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОтчисленияНаСоциальныеНужды</name>
  </enumValues>
  <enumValues>
    <name>Амортизация</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ХарактерЗатрат/ХарактерЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерЗатрат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>БракВПроизводстве</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВложенияВоВнеоборотныеАктивы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыНаСбыт</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОбщепроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>АдминистративныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперационныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВУправленческомУчете</name>
  </enumValues>
  <enumValues>
    <name>ТранспортноЗаготовительныеРасходы</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СтатьиЗатрат/ObjectModule.bsl
// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоГруппа Тогда
		
		Если ВидЗатрат.Пустая() Тогда
			Сообщить("Укажите вид затрат!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ВидЗатрат = Перечисления.ВидыЗатрат.Материальные 
		   И ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы
		   И СтатусМатериальныхЗатрат.Пустая() Тогда
			Сообщить("Укажите статус материальных затрат!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ХарактерЗатрат.Пустая() Тогда
			Сообщить("Укажите характер затрат!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		// СМАРТИС
		
		//Если Счет8Класса.Пустая() Тогда
		//	Сообщить("Укажите счет 8 класса!", СтатусСообщения.Важное);
		//	Отказ = Истина;
		//КонецЕсли;
		
		Если Не ЭтоНовый() Тогда

			Если (ВидЗатрат <> Ссылка.ВидЗатрат
					ИЛИ СтатусМатериальныхЗатрат <> Ссылка.СтатусМатериальныхЗатрат
					ИЛИ ХарактерЗатрат <> Ссылка.ХарактерЗатрат)
			   И ПолныеПрава.СтатьяЗатрат_СуществуютСсылкиВРегистрахНакопления(Ссылка)
			Тогда
				ТекстСообщения = "
				|Статья затрат """ + СокрЛП(Ссылка) + """ указана в проведенных документах.
				|Реквизиты ""Характер затрат"", ""Вид затрат"", ""Статус мат. затрат"" не могут быть изменены!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()
